package march14;

/*
 * 1. 학생 번호를 새로운 메소드에서 만들기
 * 2. 1번에서 만든 학생 번호를 전역 변수에 저장
 * 3. 새로운 학생 객체(변수)가 만들어지는 시점에 위에서 만든 학생 번호를 사용
 * -> 프로그램에서 알아서 학생 번호를 만들어 줍니다(자동 번호 생성기)
 * -> 만들 학생 번호의 규칙 정하기 : 0 -> 1 ->2... 또는 1->2->3->...또는 100->101..
 * 
 * -> 번호를 만들어 사용할 변수를 전연 변수로 선언 : 다른 함수에서도 사용 가능
 * 
 * 1) 자료형 변수이름 = 시작 데이터;
 * 2) static 자료형 변수이름 = 시작 데이터;
 * 
 */

public class TestStudentNoClass {
	
	/*
	 * 전역 변수 선언 위치
	 */

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		/*
		 * 지역 변수 선언 위치
		 */

	}
	
	/*
	 * 전역 변수 선언 위치2
	 */

}
